{
  "jobs": [
    {
      "id": "be2b29b3-9be3-40dc-aa03-76b112acd03b",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/be2b29b3-9be3-40dc-aa03-76b112acd03b",
      "created_at": "Wed Oct 09 19:35:08 UTC 2019",
      "company": "Vouch",
      "company_url": "http://vouch.us",
      "location": "San Francisco",
      "title": "Senior Frontend Engineer",
      "description": "\u003cp\u003eAbout us:\nInsurance... sounds slow, old-fashioned, and unexciting. Exactly. Insurance is broken, and it's failing fast-moving, innovative startups.\u003c/p\u003e\n\u003cp\u003eVouch is a new, technology-first insurance company, backed with $24.5M in funding from world-class investors. Like Stripe for payments or Brex for credit cards, Vouch is creating the go-to business insurance for startups.\u003c/p\u003e\n\u003cp\u003eWe're doing this by making insurance fast, responsive, and focused on our customer - startup founders. Instead of printed PDF applications and week-long waits, Vouch is building new technology to solve real problems, writing policies that actually cover relevant startup scenarios, and designing simple experiences in an otherwise frustrating industry.\u003c/p\u003e\n\u003cp\u003eThe Role:\nVouch is looking for a Front End Engineer to join our team.  You will have the opportunity to quickly contribute critical code and help to shape fundamental aspects of our codebase and engineering culture.\u003c/p\u003e\n\u003cp\u003eOur Ideal Candidate:\n5+ years of industry experience writing front-end production code\nExpert in one or more modern JavaScript frameworks like Vue, React or Angular (in order of preference)\nStrong understanding of the latest ES standards and language features\nBuild reusable front-end interfaces and components with various levels of abstraction\nCollaborate closely with product and design teams to build new features and beautiful interactive interfaces in mobile and desktop environments\nStrong understanding of modern asynchronous architecture (lazy/optimistic loading, handling 'offline' application state, etc.)\nStrong understanding of how to measure and optimize front-end performance and pagespeed metrics\nNice to haves:\nExposure to developing full stack in different programming languages (preferably Ruby/Python)\nExperience with Typescript\nExperience working with and building REST APIs as well as API design principles and best practices\u003c/p\u003e\n\u003cp\u003eWhat We Offer:\nMedical/Dental/Vision insurance\nReimbursements for cell, commuter benefits, and wellness (gym, classpass, etc.)\u003c/p\u003e\n\u003cp\u003eVouch is an equal opportunity employer and values diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status or disability status.\u003c/p\u003e\n",
      "how_to_apply": "\u003cp\u003eApply here:\n\u003ca href=\"https://grnh.se/bd0861b81\"\u003ehttps://grnh.se/bd0861b81\u003c/a\u003e\u003c/p\u003e\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaUowIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--467ec45230f320bbe663b1f59b5b416d65d8471b/V.png"
    },
    {
      "id": "3230ac37-443e-4968-86d6-10b4e4b9eb21",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/3230ac37-443e-4968-86d6-10b4e4b9eb21",
      "created_at": "Fri Sep 20 13:18:52 UTC 2019",
      "company": "Issuu.com",
      "company_url": "http://Issuu.com",
      "location": "Palo Alto",
      "title": "Integration Engineer",
      "description": "\u003cp\u003eAt Issuu, we empower content creators through cutting edge tools, technology and services. We exist to help creators of longform, highly visual content build audiences and businesses. We're looking for a Fullstack Developer to join our ride as Integration Engineer.\u003c/p\u003e\n\u003cp\u003eWe are the right company for you, if you\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ewant to work on a product that matters to a lot of people\u003c/li\u003e\n\u003cli\u003eWe receive hundreds of visits per second - and host over 50M+ publications,\u003c/li\u003e\n\u003cli\u003econsider yourself one of the best at what you do and you're looking for equally talented colleagues,\u003c/li\u003e\n\u003cli\u003eare self-driven and would never just want to take the next ticket,\u003c/li\u003e\n\u003cli\u003eare curious and never stopped learning and exploring new languages, technologies and solutions,\u003c/li\u003e\n\u003cli\u003eseek a culture where all voices matter when it comes to shaping the future of the product,\u003c/li\u003e\n\u003cli\u003ewant to work with colleagues who have ‘here to help’ attitude, and absolutely want to help you succeed.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe believe you can help us succeed by being responsible for\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003esupporting outbound marketing activities as required such as: active blogging, conference presentation, technical-paper development, and article placement,\u003c/li\u003e\n\u003cli\u003esupporting the PM in making sure the product demo is updated and running,\u003c/li\u003e\n\u003cli\u003ecreating and documenting product demonstration setups,\ndelivering demonstrations to partners and customers and at conferences,\u003c/li\u003e\n\u003cli\u003ework with the PM in presenting concepts, prototypes, wireframes, demos and the technical processes to internal and external audiences,\u003c/li\u003e\n\u003cli\u003eprototyping integrations with third party platforms, products, APIs,\u003c/li\u003e\n\u003cli\u003esupporting Product Development with insights gained from interactions with partners and customers,\ndeveloping technical documents, training guides, and presentations for internal and external use.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe are looking for someone who has\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ea Bachelor’s degree in CS or equivalent,\u003c/li\u003e\n\u003cli\u003eexperience presenting at conferences, meetups, and pitch meetings,\u003c/li\u003e\n\u003cli\u003ean ability to self-direct and solve problems with minimal input,\u003c/li\u003e\n\u003cli\u003eexperience with Functional Programming (E.g. OCaml, Erlang),\u003c/li\u003e\n\u003cli\u003ehas worked on 2+ large scale commercial projects taken from inception to production,\u003c/li\u003e\n\u003cli\u003eexperience with dynamically typed systems (e.g. Python, Javascript, Erlang),\u003c/li\u003e\n\u003cli\u003eexperience with C/C++ or other low-level languages with manual memory management,\u003c/li\u003e\n\u003cli\u003eexperience with scalable microservice architecture,\u003c/li\u003e\n\u003cli\u003ethe ability to work on any system, from code running in the browser to big data analytics dealing with - terabytes of data,\u003c/li\u003e\n\u003cli\u003estrong competence in building user interfaces,\u003c/li\u003e\n\u003cli\u003ean ability to travel domestically and abroad,\u003c/li\u003e\n\u003cli\u003eexcellent communication skills in English.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eCan you say yes to most of these qualifications? If you want to join a great team and work on something that matters, it’s time to apply!\u003c/p\u003e\n\u003cp\u003eWould You Like to Join?\nThis is the perfect opportunity to join a multinational company and being able to leave your mark on processes and procedures that impacts everyone at Issuu. You will get the opportunity to travel to our CPH office as part of your onboarding and hereafter as agreed upon in your team.\u003c/p\u003e\n\u003cp\u003eIn our Palo Alto office, you’ll find members from all parts of Issuu, including Product, Design, Customer Success, Data Analytics, Marketing, BD and Management. We are conveniently close to the Palo Alto Caltrain Station and provide delicious catered lunches, regular outings, healthy drinks and snacks, and a friendly, creative, welcoming atmosphere in a cool office set-up. As if that wasn’t enough, we offer a state of the art health benefits, amazing colleagues, and a flexible working environment.\u003c/p\u003e\n\u003cp\u003eDetails: A valid US work permit is required.\u003c/p\u003e\n\u003cp\u003eDig deeper.\nMost of our content creators are on a mission to change their world in some way. They are passionate and driven and we consider ourselves the same. Check some of them out:\u003c/p\u003e\n\u003cp\u003eThe avantgarde Italian kids fashion magazine: \u003ca href=\"https://issuu.com/kidswearmagazine\"\u003ehttps://issuu.com/kidswearmagazine\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eThe San Francisco Opera magazine: \u003ca href=\"https://issuu.com/sanfranciscoopera\"\u003ehttps://issuu.com/sanfranciscoopera\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eThe Danish outdoor garage start-up magazine: \u003ca href=\"https://issuu.com/outsite.org\"\u003ehttps://issuu.com/outsite.org\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eThe Polish/Irish photographer: \u003ca href=\"https://issuu.com/thefix-analogue-magazine\"\u003ehttps://issuu.com/thefix-analogue-magazine\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eThe American Meteorite Exchange Inc. Magazine: \u003ca href=\"https://issuu.com/meteorite-times\"\u003ehttps://issuu.com/meteorite-times\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eWe encourage everyone to apply regardless of race, religion, color, national origin, gender, sexual orientation, age, marital, veteran or disability status.\u003c/p\u003e\n",
      "how_to_apply": "\u003cp\u003ePlease submit your application through this link: \u003ca href=\"https://jobs.lever.co/issuu/0d2686cc-75af-4160-a89e-0044bd0ac7ea\"\u003ehttps://jobs.lever.co/issuu/0d2686cc-75af-4160-a89e-0044bd0ac7ea\u003c/a\u003e\u003c/p\u003e\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc3h5IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--7fe847ec67b3b620949c364ff898352190271d00/issuu-logo-stacked-colour.jpg"
    },
    {
      "id": "092c5660-bd5c-484f-96fe-0d9796e87031",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/092c5660-bd5c-484f-96fe-0d9796e87031",
      "created_at": "Thu Sep 19 21:48:28 UTC 2019",
      "company": "LeapYear",
      "company_url": "https://leapyear.ai/careers",
      "location": "San Francisco",
      "title": "Haskell Engineer at LeapYear - Core Platform",
      "description": "\u003ch2\u003eWhat we do\u003c/h2\u003e\n\u003cp\u003eLeapYear's secure machine learning platform is deployed by some of the largest enterprises in the world across finance, healthcare, and technology.\u003c/p\u003e\n\u003cp\u003eOur technology ensures differential privacy, a widely recognized standard of data privacy that enables all data - including sensitive information - to be utilized for analytics, while providing mathematically proven privacy protection.\u003c/p\u003e\n\u003cp\u003eThe LeapYear system is composed of a core set of components that allow private machine learning on data sets that can scale to petabytes. The system includes private algorithms for relational operations, statistical methods and machine learning. A data scientist accesses private data using a Python API. Administration is provided  via a web-based GUI or an API.\u003c/p\u003e\n\u003cp\u003eLeapYear's platform team builds the services that allow our product to integrate with complex enterprise environments and operate effectively on our customers’ most sensitive data.\u003c/p\u003e\n\u003cp\u003eThe platform includes services for authentication, access control, logging, auditing  and support for integration of data from a variety of data sources including SQL/NoSQL Databases, HDFS and S3. Queries are processed using Spark to support to enable fast, distributed processing  of massive data sets. The services are primarily written in Haskell, with Python, Scala, and Java used as additional supporting languages.\u003c/p\u003e\n\u003cp\u003eWe are looking for platform engineers that have a track record of developing enterprise-ready features for technical end users, including enterprise integrations, rigorous security, flexible deployment, and support for diverse data sources.\u003c/p\u003e\n\u003ch2\u003eRecent technical challenges we've been working on\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eDeveloping a Spark-based query engine with strong typechecking.\u003c/li\u003e\n\u003cli\u003eAchieving terabyte and petabyte scale on Spark.\u003c/li\u003e\n\u003cli\u003eRefactoring our persistence layer.\u003c/li\u003e\n\u003cli\u003eUsing Haskell to implement enterprise-ready subsystems for authentication, permissioning, job management, and logging.\u003c/li\u003e\n\u003cli\u003eExtending the platform to support automated daily data updates.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eFor details on the specific responsibilities and requirements of this role, please see below.\u003c/p\u003e\n\u003ch2\u003eResponsibilities\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eDevelop greenfield systems and scale existing services to support internet-scale deployments.\u003c/li\u003e\n\u003cli\u003eOwn the full software development lifecycle - problem definition, design, development, testing, demoing, and supporting production use of the features you own.\u003c/li\u003e\n\u003cli\u003ePartner with product management to define problems and identify iterative solutions\u003c/li\u003e\n\u003cli\u003eBalance immediate business objectives against long-term architectural vision\u003c/li\u003e\n\u003cli\u003eContribute to an engineering-wide culture of code quality and shared responsibility for testing\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eRequirements\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003e5+ years of professional experience writing production code\u003c/li\u003e\n\u003cli\u003eAcquainted with and interested in functional programming (Haskell, OCaml, Clojure, Erlang, Scala)\u003c/li\u003e\n\u003cli\u003eTrack record of delivering high-quality product features on schedule\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003ePreferred\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eExperience developing for on-premise enterprise deployments\u003c/li\u003e\n\u003cli\u003eProfessional experience with functional programming\u003c/li\u003e\n\u003cli\u003ePrior experience developing production-level Spark applications or machine learning platforms\u003c/li\u003e\n\u003cli\u003eExperience with ODBC/JDBC databases, AWS, CircleCI\u003c/li\u003e\n\u003cli\u003eLifelong learners and mentors\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eA Few of the Perks\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eCulture of teaching and learning\u003c/li\u003e\n\u003cli\u003eCompetitive compensation package of salary and equity\u003c/li\u003e\n\u003cli\u003eCatered lunch every day\u003c/li\u003e\n\u003cli\u003eCompany outings\u003c/li\u003e\n\u003cli\u003eBuild your ideal work station\u003c/li\u003e\n\u003cli\u003eGenerous health insurance plan\u003c/li\u003e\n\u003cli\u003eRelocation support and visa sponsorship\u003c/li\u003e\n\u003c/ul\u003e\n",
      "how_to_apply": "\u003cp\u003eSubmit an application at \u003ca href=\"https://leapyear.ai/careers\"\u003ehttps://leapyear.ai/careers\u003c/a\u003e\u003c/p\u003e\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdUZ5IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--53d46724c12970a933bdb01988af00e6b043b39e/LeapYear%20Logo%20Transparent%20Black%20cropped.png"
    },
    {
      "id": "83ac3dae-577b-4027-bfa4-fd58d4ca12ce",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/83ac3dae-577b-4027-bfa4-fd58d4ca12ce",
      "created_at": "Fri Sep 13 16:43:56 UTC 2019",
      "company": "Lawrence Berkeley National Laboratory (LBNL)",
      "company_url": null,
      "location": "Berkeley",
      "title": "Staff Systems Administrator 3 ",
      "description": "\u003cp\u003eStaff Systems Administrator 3 - 87840\nOrganization: AL-Advanced Light Source\u003c/p\u003e\n\u003cp\u003eBerkeley Lab has an opening for a Systems Administrator at the Advanced Light Source\u003c/p\u003e\n\u003cp\u003eBerkeley Lab’s Advanced Light Source (ALS, \u003ca href=\"https://als.lbl.gov/\"\u003ehttps://als.lbl.gov/\u003c/a\u003e) needs a Systems Administrator to lead the ALS IT team and manage the ALS computing infrastructure. The Systems Administrator will work closely with ALS operations, computing and controls staff with a high level of autonomy.  The ideal candidate will have in-depth technical knowledge of operating systems, networking, security, and data center management. As the primary IT representative for the ALS, this position will also collaborate with other divisions on projects of significant scope - potentially affecting IT policy for the greater LBL community.\u003c/p\u003e\n\u003cp\u003eThe ALS is a dynamic national scientific user facility that provides thousands of scientists from around the world access to bright beams of x-rays, infrared, and extreme ultraviolet light for scientific studies and technology development in disciplines spanning physical, chemical, materials, biological, energy, and Earth sciences. The ALS has been a global leader in soft x-ray science for more than two decades and is currently undertaking a new project (ALS-U, \u003ca href=\"https://als.lbl.gov/als-u/overview/\"\u003ehttps://als.lbl.gov/als-u/overview/\u003c/a\u003e) that will endow the facility with state-of-the-art x-ray capabilities. It's an exciting time to join our growing team!\u003c/p\u003e\n\u003cp\u003eThe core values of the ALS reflect a strong commitment to diversity, equity, and inclusion. We seek candidates who will support a culture in which the entire ALS community feels welcomed and valued.\u003c/p\u003e\n\u003cp\u003eWhat You Will Do:\n• Manage ALS computing infrastructure, provide guidance and expert consultation to Linux, network, and security groups.\n• Act as ALS IT liaison to departments within the IT Division and direct and coordinate projects of complex scope involving network architecture, virtual infrastructure, and storage systems.\n• Administer ALS Active Directory domain: develop and set domain policy, create user and computer accounts. Troubleshoot complex AD issues such as authentication problems or domain controller synchronization failures.\n• Maintain and manage virtual infrastructure. Create and administer virtual machines for various functions such as web servers, desktop applications, or virtual control room consoles. Automate routine tasks using a scripting language such as Python or PowerShell. Perform server upgrades and provide architectural improvements.\n• Maintain Nagios monitoring infrastructure. Develop plugins and scripts to extend capabilities. Provide training to Operations staff on usage.\n• Stay up to date on the latest technologies and implement where appropriate; use knowledge to recommend and develop new, creative solutions.\n• Provide end-user computer support\n• Support accelerator operations: test controls \u0026amp; computer systems during startup and tune periods; provide control room application support; off hours IT support as needed.\n• Manage desktop and rack-installed computers.  This includes configuring access control, patch management, custom group policies, and other administrative functions.\n• Collaborate with other divisions and IT departments on projects, develop best practices regarding IT policy.\n• Manage ALS server rooms - deal with cooling, electrical, and safety issues associated with data center management. Approve and manage server layout within racks. Hold training sessions for staff as required for access.\n• Supervise systems administrator and student(s). Provide growth opportunities and handle escalated issues. Backup as needed during absences.\u003c/p\u003e\n\u003cp\u003eWhat is Required:\n• Bachelor’s Degree and a minimum of 8 years related experience in IT or equivalent experience.\n• Demonstrated ability to perform work with a minimum of supervision.\n• In-depth knowledge of Windows and Linux platforms and knowledge of Mac OS X. Well-versed in cross-platform issues.\n• Familiarity with VM infrastructure systems such as VMWare, Hyper-V, Proxmox, etc.\n• Significant knowledge of Microsoft technologies including Windows Server 2012 R2, Active Directory, Hyper-V, Failover Clustering. Experience managing Active Directory domains including GPO development and understanding trust relationships.\n• Strong written and interpersonal communication skills; ability to interact positively with a variety of colleagues.\n• Ability to lift and move equipment associated with desktop and server systems.\u003c/p\u003e\n\u003cp\u003eAdditional Desired Qualifications:\n• Experience in a supervisory role.\n• Knowledge of Nagios monitoring system, proven ability to write plugins and customize system.\n• Programming and/or scripting experience (PowerShell, Bash, Python, C/C++).\n• In-depth knowledge of computer hardware including standard Mac/PC components, rack mount server hardware.\n• Knowledge of enterprise storage systems such as Netapp.\n• Strong understanding of RAID concepts and RAID levels.\n• Strong knowledge of TCP/IP and OSI model, related protocols.\n• Experience with data center management including rack layout, power management and cooling requirements.\n• Knowledge of computer security principles; defense in depth, common attack vectors and mitigations.\n• Knowledge of control systems, data acquisition and data analysis devices.\n• Experience performing packet analysis with Wireshark/tcpdump.\n• Familiarity with EPICS and real time systems.\n• Previous experience in a 24/7 research environment.\n• MCSE Certified.\n• Apple certifications, ACMT and/or ACSP.\u003c/p\u003e\n\u003cp\u003eThe posting shall remain open until the position is filled, however for full consideration, please apply by close of business on September 30, 2019.\u003c/p\u003e\n\u003cp\u003eNotes:\n• This is a full time career appointment.\n• Full-time, M-F, exempt (monthly paid) from overtime pay.\n• This position may be subject to a background check. Any convictions will be evaluated to determine if they directly relate to the responsibilities and requirements of the position. Having a conviction history will not automatically disqualify an applicant from being considered for employment.\n• Work will be primarily performed at: Lawrence Berkeley National Lab, 1 Cyclotron Road, Berkeley, CA.\u003c/p\u003e\n\u003cp\u003eHow To Apply\nApply directly online at \u003ca href=\"http://50.73.55.13/counter.php?id=169046\"\u003ehttp://50.73.55.13/counter.php?id=169046\u003c/a\u003e and follow the on-line instructions to complete the application process.\u003c/p\u003e\n\u003cp\u003eLearn About Us:\nBerkeley Lab (LBNL, \u003ca href=\"http://www.lbl.gov/\"\u003ehttp://www.lbl.gov/\u003c/a\u003e) addresses the world’s most urgent scientific challenges by advancing sustainable energy, protecting human health, creating new materials, and revealing the origin and fate of the universe. Founded in 1931, Berkeley Lab’s scientific expertise has been recognized with 13 Nobel prizes. The University of California manages Berkeley Lab for the U.S. Department of Energy’s Office of Science.\u003c/p\u003e\n\u003cp\u003eWorking at Berkeley Lab has many rewards including a competitive compensation program, excellent health and welfare programs, a retirement program that is second to none, and outstanding development opportunities.  To view information about the many rewards that are offered at Berkeley Lab- Click Here (\u003ca href=\"https://hr.lbl.gov/\"\u003ehttps://hr.lbl.gov/\u003c/a\u003e).\u003c/p\u003e\n\u003cp\u003eEqual Employment Opportunity: Berkeley Lab is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, age, or protected veteran status. Berkeley Lab is in compliance with the Pay Transparency Nondiscrimination Provision under 41 CFR 60-1.4 (\u003ca href=\"https://www.dol.gov/ofccp/PayTransparencyNondiscrimination.html\"\u003ehttps://www.dol.gov/ofccp/PayTransparencyNondiscrimination.html\u003c/a\u003e).  Click here (\u003ca href=\"http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf\"\u003ehttp://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf\u003c/a\u003e) to view the poster: \"Equal Employment Opportunity is the Law\".\u003c/p\u003e\n",
      "how_to_apply": "\u003cp\u003eApply directly online at \u003ca href=\"http://50.73.55.13/counter.php?id=169046\"\u003ehttp://50.73.55.13/counter.php?id=169046\u003c/a\u003e and follow the on-line instructions to complete the application process.\u003c/p\u003e\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaHB5IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8db97f7be72672faf5b21ce1f39dcf491c9996e0/Lawrence%20Berkeley%20Lab%20blue%20background.png"
    },
    {
      "id": "9999f1f0-e448-11e8-966e-602e38acf303",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/9999f1f0-e448-11e8-966e-602e38acf303",
      "created_at": "Fri Nov 09 21:36:14 UTC 2018",
      "company": "BlueVine",
      "company_url": "http://bluevine.com",
      "location": "Redwood City, Ca",
      "title": "Senior Python Developer",
      "description": "\u003cp\u003eAt BlueVine, we’re transforming how businesses get access to working capital financing. Founded in 2013, our online lending platform has helped 10,000+ business owners simplify their cashflow management, boost growth, and take advantage of new opportunities. As a leading FinTech company, we’re backed by Menlo Ventures, LightSpeed Ventures, 83North, Silicon Valley Bank, Citi Ventures, Microsoft Ventures and Nationwide Insurance among other notable investors. Our clients love us, the market we’re going after is huge, and we’re just getting started.\u003c/p\u003e\n\u003cp\u003eWe’re looking for exceptional people to help deliver the next generation of business financing solutions. We are a group of fun, creative, and motivated people that like to tackle challenges head on. If you have a strong desire to be part of a small, agile team, in an exciting and growing space, you’ll find your next job at BlueVine.\u003c/p\u003e\n\u003cp\u003eAs a \u003cstrong\u003eSenior Python Developer\u003c/strong\u003e at BlueVine you will be an important part of leading our platform development, and be a key member of our tech team.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBENEFITS \u0026amp; PERKS:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eReceive over $1,000 annually for a wellness benefit of your choice\u003c/li\u003e\n\u003cli\u003eFree commuter benefits - CalTrain passes for SF employees and a monthly parking allowance for SF/NJ employees\u003c/li\u003e\n\u003cli\u003eWeekly catered lunches\u003c/li\u003e\n\u003cli\u003eUnlimited snacks in fully stocked kitchens\u003c/li\u003e\n\u003cli\u003eGenerous PTO and holidays\u003c/li\u003e\n\u003cli\u003eExcellent health coverage and life insurance benefits\u003c/li\u003e\n\u003cli\u003eGenerous, paid parental leave which covers up to 15 weeks\u003c/li\u003e\n\u003cli\u003ePet-friendly offices\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWHAT YOU'LL DO:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eArchitect and build state-of-the-art web \u0026amp; mobile application using a variety of languages and tools\u003c/li\u003e\n\u003cli\u003eBuild distributed backend application in the cloud\u003c/li\u003e\n\u003cli\u003eUnderstand repeatable automated processes for building the application, test it, document it, and deploy it at scale\u003c/li\u003e\n\u003cli\u003eA desire to work as part of a growing, fast-paced, and highly-flexible team\u003c/li\u003e\n\u003cli\u003eWork closely with, and incorporate feedback from, product designers and other stakeholders in the company\u003c/li\u003e\n\u003cli\u003eBe able to develop a project through its entire lifecycle\u003c/li\u003e\n\u003cli\u003eHave strong attention to details, a strong sense of ownership, pride in the quality of one's work and the ability to meet deadlines\u003c/li\u003e\n\u003cli\u003eProvide technical direction and guidance, as well as draft specifications, architect solutions, define timelines, advise on industry best practice and problems to be solved\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWHAT WE LOOK FOR:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eKnowledge of Python (4+ years)\u003c/li\u003e\n\u003cli\u003eKnowledge of Django (2+ years)\u003c/li\u003e\n\u003cli\u003eExperience with Celery, RESTful APIs and server-side APIs integration\u003c/li\u003e\n\u003cli\u003eKnowledge of ORM, SQL and Data Modeling\u003c/li\u003e\n\u003cli\u003eExperience with TDD and ability to write quality unit tests\u003c/li\u003e\n\u003cli\u003eExperience with AWS, cloud deployments, devops and web security\u003c/li\u003e\n\u003cli\u003eKnowledge of JavaScript, HTML5, CSS3\u003c/li\u003e\n\u003cli\u003eAbility to quickly learn new technologies and adapt to a fast-paced development environment\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBlueVine’s mission is to help business owners succeed and thrive by making sure they have convenient access to capital for their everyday funding needs. We’ve helped thousands of businesses since we started in 2013, funding more than $1 billion in working capital through our pioneering online platform. Our invoice factoring product allows business to receive cash advances on their outstanding invoices, offering factoring lines of up to $5 million. Our business line of credit product, called Flex Credit, offers financing based on 6-month and 12-month payment terms, and credit lines of up to $250,000. Based in Redwood City, Calif., BlueVine is backed by leading venture capital firms.\u003c/p\u003e\n",
      "how_to_apply": "\u003cp\u003e[Senior Python Developer] (\u003ca href=\"https://jobs.lever.co/bluevine/17ae9fff-deb7-4f61-b2cb-4507840e24bf?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\"\u003ehttps://jobs.lever.co/bluevine/17ae9fff-deb7-4f61-b2cb-4507840e24bf?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\u003c/a\u003e)\u003c/p\u003e\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcVpXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8b6025c5a6fe7b1fcfa4d8ead233a6ef0e956a5a/98456b19-f8cb-4e7c-863d-6dafefc20196"
    },
    {
      "id": "fa55ec4a-dd65-11e8-867f-7944d54de916",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/fa55ec4a-dd65-11e8-867f-7944d54de916",
      "created_at": "Wed Oct 31 23:38:11 UTC 2018",
      "company": "Bio-Rad Laboratories",
      "company_url": "http://www.bio-rad.com",
      "location": "Pleasanton, CA",
      "title": "Backend Web Developer (Software Developer III Non-IT)",
      "description": "\u003cp\u003eBackend Web Developer (Software Developer III Non-IT)\nBio-Rad Laboratories\u003c/p\u003e\n\u003cp\u003eOverview\nWho We Are and What We Do\u003c/p\u003e\n\u003cp\u003eBio-Rad is an established Fortune 1000 biotech company that creates products that help people live longer, healthier lives. Bio-Rad’s Digital Biology Group (DBG) in Pleasanton makes products (including data products) that are helping to eradicate cancer (among other things). We’ve worked hard at building a great culture here at the DBG that cultivates collaboration and innovation, and people are honestly really passionate about what they do here. Check Us Out\u003c/p\u003e\n\u003cp\u003eWhat We Are Looking For\u003c/p\u003e\n\u003cp\u003eA solid backend developer who will develop and own our cloud-based applications and platform for all our data products at the DBG. Are you passionate about delivering highly scalable and reusable code? Does driving and influencing cloud strategy at a Fortune 1000 company excite you?\u003c/p\u003e\n\u003cp\u003eResponsibilities\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBe one of the founding members of our new cloud data platform.\u003c/li\u003e\n\u003cli\u003eWork in a collaborative environment to apply well architected solutions within this space.\u003c/li\u003e\n\u003cli\u003eArchitect complex business logic and features to add to our web based applications from concept to implementation.\u003c/li\u003e\n\u003cli\u003eWork alongside Scientists, Marketing, and R\u0026amp;D Engineers through the Product Development life cycle and beyond.\u003c/li\u003e\n\u003cli\u003eDevelop / Improve the core infrastructure for high scalability.\u003c/li\u003e\n\u003cli\u003eWorking with an awesome group of humble, (super smart), hardworking team players that own their technical debt and slay it.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eQualifications\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e5+ years’ experience as a Software Developer.\u003c/li\u003e\n\u003cli\u003eHands-on development experience with Python, Flask and Java in Linux environments.\u003c/li\u003e\n\u003cli\u003eHave successfully built scalable APIs according to best practices.\u003c/li\u003e\n\u003cli\u003eExperience with MySql, NoSQL databases, familiarity with Spark or Redshift Data warehousing.\u003c/li\u003e\n\u003cli\u003eExperience with Cloud Hosting (AWS preferred).\u003c/li\u003e\n\u003cli\u003eQuick learner with the ability to understand complex workflows and develop and validate innovative solutions to solve difficult problems.\u003c/li\u003e\n\u003cli\u003eExperienced with test automation: TDD, unit/integration/functional testing.\u003c/li\u003e\n\u003cli\u003eExperienced implementation efforts following an Agile software development lifecycle approach.\u003c/li\u003e\n\u003cli\u003eExcellent communication skills, both written and verbal.\u003c/li\u003e\n\u003cli\u003eA team-oriented contributor that aims to enhance the effectiveness of their colleagues.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAbout Bio-Rad:\u003c/p\u003e\n\u003cp\u003eBio-Rad is a global leader providing a broad array of clinical diagnostics and life science research products. With a team of more than 7,800 employees and a global network of operations serving our customers, we help people live longer, healthier lives.\u003c/p\u003e\n\u003cp\u003eBio-Rad was founded over six decades ago and has continued to provide the healthcare industry with innovative and useful products that help life science researchers accelerate the discovery process and medical diagnostic labs obtain faster, better results.\u003c/p\u003e\n\u003cp\u003eEEO/AA Employer/Veterans/Disabled/Race/Ethnicity/Gender/Age\u003c/p\u003e\n\u003cp\u003eAgency Non-Solicitation:\u003c/p\u003e\n\u003cp\u003eBio-Rad does not accept agency resumes, unless the agency has been authorized by a Bio-Rad Recruiting Representative. Please do not submit resumes unless authorized to do so. Bio-Rad will not pay for any fees related to unsolicited resumes.\u003c/p\u003e\n",
      "how_to_apply": "\u003cp\u003eFor full application instructions and position description, visit \u003ca href=\"http://apptrkr.com/1325674\"\u003ehttp://apptrkr.com/1325674\u003c/a\u003e\u003c/p\u003e\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBanhXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--405fc0cd9aa563ecebeb8a7c041756da5d943aa1/9cdade0a-86e8-468a-855c-c5e820ec6520"
    },
    {
      "id": "48d5274e-dd45-11e8-8130-eacb3354d656",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/48d5274e-dd45-11e8-8130-eacb3354d656",
      "created_at": "Wed Oct 31 19:45:06 UTC 2018",
      "company": "Traction",
      "company_url": "https://www.tractionco.com/",
      "location": "Sunnyvale, CA ",
      "title": "Lead Full Stack Developer",
      "description": "\u003cp\u003eThe Job:\u003c/p\u003e\n\u003cp\u003eTraction is looking for a Lead Full Stack Developer. You should have prior experience architecting and developing advanced dynamic projects involving technologies for Front-end, Back-end, Database, DevOps and Mobile, as well as leading teams of engineers working on these projects.\u003c/p\u003e\n\u003cp\u003eThis role will see you leading a team of developers as well as being an individual contributor to the team.\u003c/p\u003e\n\u003cp\u003eWe’re on a mission to become one of the most in-demand agencies in the United States, sought out by the best brands in the world to design meaningful experiences for their customers.\u003c/p\u003e\n\u003cp\u003eMust be available to work onsite in Sunnyvale, CA exclusively working embedded with our client that is headquartered in Cupertino.\u003c/p\u003e\n\u003cp\u003eCore Responsibilities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAct as the primary technical contact for an engineering team with other teams across disciplines, potentially leading a team of 2-5 developers\u003c/li\u003e\n\u003cli\u003eWork closely with the development manager to ensure requirements and timelines are met\u003c/li\u003e\n\u003cli\u003eWork closely with the development manager and back-end teams to architect and integrate front-end code\u003c/li\u003e\n\u003cli\u003eDevelop advanced applications with a mixture of third-party and proprietary tools and libraries\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eSkills and Experience:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience as a lead developer\u003c/li\u003e\n\u003cli\u003e2+ years of experience building websites using HTML, CSS, and JavaScript\u003c/li\u003e\n\u003cli\u003e8+ years of experience building web applications with any common web technologies (Node.JS, Java, .Net, PHP, Ruby, Python)\u003c/li\u003e\n\u003cli\u003e8+ years of experience with modern web frameworks and/or libraries such as React, Angular, etc.\u003c/li\u003e\n\u003cli\u003e8+ years of experience in modeling n-tier applications\u003c/li\u003e\n\u003cli\u003e6+ years of experience in database modeling; PL/SQL and SQL. MongoDB is a plus\u003c/li\u003e\n\u003cli\u003eExperience writing unit tests for web applications\u003c/li\u003e\n\u003cli\u003eExperience with containers and container platforms (Docker, Mesos, Kubernetes)\u003c/li\u003e\n\u003cli\u003eExperience in defining continuous integration build processes for front-end web development\u003c/li\u003e\n\u003cli\u003eFamiliarity with CI/CD strategy (AWS, Heroku, Google Cloud)/\u003c/li\u003e\n\u003cli\u003eKnowledge of common design patterns in web development (i.e., MVC, MVVM)\u003c/li\u003e\n\u003cli\u003eWorking knowledge of source control software such as Git (preferred) or SVN\u003c/li\u003e\n\u003cli\u003eExposure to Agile project management methodologies\u003c/li\u003e\n\u003cli\u003eAbility to multi-task and manage tasks with varying priorities\u003c/li\u003e\n\u003cli\u003eMust be able to brainstorm and communicate technology ideas and issues with peers and management\u003c/li\u003e\n\u003cli\u003eExcellent verbal and written communication skills\u003c/li\u003e\n\u003cli\u003eExperience in developing applications for Supply Chain business domain, with more focus on Supply Planning, Demand Planning\u003c/li\u003e\n\u003cli\u003eWillingness to learn new technologies and implement in short time\u003c/li\u003e\n\u003cli\u003eComfortable working in a multi-discipline, geographically dispersed team\u003c/li\u003e\n\u003cli\u003eExperience in leading a team of developers through all processes of development and integration, including test automation\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eEducation: BA or BS in computer science or equivalent experience\u003c/p\u003e\n\u003cp\u003eExtra Credit:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with e-commerce\u003c/li\u003e\n\u003cli\u003eKnowledge of accessibility specifications\u003c/li\u003e\n\u003cli\u003eExperience with GraphQL\u003c/li\u003e\n\u003cli\u003eExperience with Scala\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOur humblebrag:\nJoin an award-winning, digitally-focused, full-service, independent agency staffed by a bunch of folks who love what they do and do what they love. Still on the rise after 17 years of success, you’ll enjoy a satisfying suite of benefits, as well as the chance to work on the world's most well-know brand.\u003c/p\u003e\n\u003cp\u003eWill you accept our mission?\nTraction is dedicated to creating meaningful advertising, branding, and experiences for our clients and their consumers. In order to accomplish this, we have fostered a culture rooted in autonomy, empowerment, collaboration, and—occasionally—mischief. We believe that great work is spontaneous, and the best ideas come from a diverse team of creatively-minded individuals. Our goal is to be an agency where the journey getting there is as great as the work itself, and we’re looking for the right people to help us do it.\u003c/p\u003e\n",
      "how_to_apply": "\u003cp\u003e\u003ca href=\"https://traction.applytojob.com/apply/rpfYAlIVTX/Lead-Full-Stack-Developer\"\u003ehttps://traction.applytojob.com/apply/rpfYAlIVTX/Lead-Full-Stack-Developer\u003c/a\u003e\u003c/p\u003e\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBanhXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--405fc0cd9aa563ecebeb8a7c041756da5d943aa1/9cdade0a-86e8-468a-855c-c5e820ec6520"
    }
  ]
}
